TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l112x.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_m0p_mspm0l112x__include
#define ti_devices_msp_m0p_mspm0l112x__include

/* Filename: mspm0l112x.h */
/* Revised: 2025-05-22 14:35:05*/

/* Use standard integer types with explicit width */
#include <stdint.h>
#include <stdbool.h>

#ifdef __cplusplus
 extern "C" {
#endif

/** @addtogroup MSPM0L112X_Definitions MSPM0L112X Definitions
  This file defines all structures and symbols for MSPM0L112X
  @{
*/

/** @addtogroup MSPM0L112X_CMSIS Device CMSIS Definitions
  Configuration of the Processor and Core Peripherals
  @{
*/
/******************************************************************************
* Interrupt Definitions                                                       *
******************************************************************************/
typedef enum IRQn
{
  NonMaskableInt_IRQn         = -14,    /* 2  Non Maskable Interrupt */
  HardFault_IRQn              = -13,    /* 3  Hard Fault Interrupt */
  SVCall_IRQn                 = -5,     /* 11 SV Call Interrupt */
  PendSV_IRQn                 = -2,     /* 14 Pend SV Interrupt */
  SysTick_IRQn                = -1,     /* 15 System Tick Interrupt */
  SYSCTL_INT_IRQn             = 0,      /* 16 SYSCTL_INT Interrupt */
  DEBUGSS_INT_IRQn            = 1,      /* 17 DEBUGSS_INT Interrupt */
  UC6_INT_IRQn                = 3,      /* 19 UC6_INT Interrupt */
  ADC0_INT_IRQn               = 4,      /* 20 ADC0_INT Interrupt */
  TIMB0_INT_IRQn              = 5,      /* 21 TIMB0_INT Interrupt */
  TIMB1_INT_IRQn              = 6,      /* 22 TIMB1_INT Interrupt */
  COMP0_INT_IRQn              = 7,      /* 23 COMP0_INT Interrupt */
  UC7_INT_IRQn                = 8,      /* 24 UC7_INT Interrupt */
  UC8_INT_IRQn                = 9,      /* 25 UC8_INT Interrupt */
  TIMB2_INT_IRQn              = 13,     /* 29 TIMB2_INT Interrupt */
  TIMB3_INT_IRQn              = 14,     /* 30 TIMB3_INT Interrupt */
  UC4_INT_IRQn                = 15,     /* 31 UC4_INT Interrupt */
  TIMG14_INT_IRQn             = 16,     /* 32 TIMG14_INT Interrupt */
  TIMG2_INT_IRQn              = 17,     /* 33 TIMG2_INT Interrupt */
  TIMA0_INT_IRQn              = 18,     /* 34 TIMA0_INT Interrupt */
  TIMG1_INT_IRQn              = 19,     /* 35 TIMG1_INT Interrupt */
  GPIOA_INT_IRQn              = 22,     /* 38 GPIOA_INT Interrupt */
  GPIOB_INT_IRQn              = 23,     /* 39 GPIOB_INT Interrupt */
  UC11_INT_IRQn               = 24,     /* 40 UC11_INT Interrupt */
  AESADV_INT_IRQn             = 26,     /* 42 AESADV_INT Interrupt */
  FLASHCTL_INT_IRQn           = 27,     /* 43 FLASHCTL_INT Interrupt */
  WWDT0_INT_IRQn              = 29,     /* 45 WWDT0_INT Interrupt */
  LFSS_INT_IRQn               = 30,     /* 46 LFSS_INT Interrupt */
  RTC_B_INT_IRQn              = 30,     /* 46 RTC_B_INT Interrupt */
  IWDT_INT_IRQn               = 30,     /* 46 IWDT_INT Interrupt */
  DMA_INT_IRQn                = 31,     /* 47 DMA_INT Interrupt */
} IRQn_Type;

#define NonMaskableInt_VECn     2     /* Non Maskable Interrupt */
#define HardFault_VECn          3     /* Hard Fault Interrupt */
#define SVCall_VECn             11    /* SV Call Interrupt */
#define PendSV_VECn             14    /* Pend SV Interrupt */
#define SysTick_VECn            15    /* System Tick Interrupt */
#define SYSCTL_INT_VECn         16    /* SYSCTL_INT Interrupt */
#define DEBUGSS_INT_VECn        17    /* DEBUGSS_INT Interrupt */
#define UC6_INT_VECn            19    /* UC6_INT Interrupt */
#define ADC0_INT_VECn           20    /* ADC0_INT Interrupt */
#define TIMB0_INT_VECn          21    /* TIMB0_INT Interrupt */
#define TIMB1_INT_VECn          22    /* TIMB1_INT Interrupt */
#define COMP0_INT_VECn          23    /* COMP0_INT Interrupt */
#define UC7_INT_VECn            24    /* UC7_INT Interrupt */
#define UC8_INT_VECn            25    /* UC8_INT Interrupt */
#define TIMB2_INT_VECn          29    /* TIMB2_INT Interrupt */
#define TIMB3_INT_VECn          30    /* TIMB3_INT Interrupt */
#define UC4_INT_VECn            31    /* UC4_INT Interrupt */
#define TIMG14_INT_VECn         32    /* TIMG14_INT Interrupt */
#define TIMG2_INT_VECn          33    /* TIMG2_INT Interrupt */
#define TIMA0_INT_VECn          34    /* TIMA0_INT Interrupt */
#define TIMG1_INT_VECn          35    /* TIMG1_INT Interrupt */
#define GPIOA_INT_VECn          38    /* GPIOA_INT Interrupt */
#define GPIOB_INT_VECn          39    /* GPIOB_INT Interrupt */
#define UC11_INT_VECn           40    /* UC11_INT Interrupt */
#define AESADV_INT_VECn         42    /* AESADV_INT Interrupt */
#define FLASHCTL_INT_VECn       43    /* FLASHCTL_INT Interrupt */
#define WWDT0_INT_VECn          45    /* WWDT0_INT Interrupt */
#define LFSS_INT_VECn           46    /* LFSS_INT Interrupt */
#define RTC_B_INT_VECn          46    /* RTC_B_INT Interrupt */
#define IWDT_INT_VECn           46    /* IWDT_INT Interrupt */
#define DMA_INT_VECn            47    /* DMA_INT Interrupt */


