TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l112x.h
/******************************************************************************
* Ignore unused variables                                                     *
******************************************************************************/

#if   defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/******************************************************************************
* Processor and Core Peripheral Section                                       *
******************************************************************************/

#define __CM0PLUS_REV           0x0001U       /* Core revision */
#define __MPU_PRESENT           0x0001U       /* MPU present */
#define __VTOR_PRESENT          0x0001U       /* VTOR present */
#define __NVIC_PRIO_BITS        0x0002U       /* Number of bits used for Priority Levels */
#define __Vendor_SysTickConfig  0x0000U       /* Set to 1 if different SysTick Config is used */

#include "core_cm0plus.h"                  /* Processor and core peripherals */

/******************************************************************************
* Peripheral headers                                                          *
******************************************************************************/
/** @addtogroup MSPM0L112X_Peripherals MSPM0L112X Peripherals
  MSPM0L112X Peripheral registers structures
  @{
*/

#include <ti/devices/msp/peripherals/hw_adc12.h>
#include <ti/devices/msp/peripherals/hw_aesadv.h>
#include <ti/devices/msp/peripherals/hw_btimer.h>
#include <ti/devices/msp/peripherals/hw_comp.h>
#include <ti/devices/msp/peripherals/hw_crc.h>
#include <ti/devices/msp/peripherals/hw_dma.h>
#include <ti/devices/msp/peripherals/hw_flashctl.h>
#include <ti/devices/msp/peripherals/hw_gpio.h>
#include <ti/devices/msp/peripherals/hw_gptimer.h>
#include <ti/devices/msp/peripherals/hw_iomux.h>
#include <ti/devices/msp/peripherals/hw_keystorectl.h>
#include <ti/devices/msp/peripherals/hw_rtc.h>
#include <ti/devices/msp/peripherals/hw_lfss.h>
#include <ti/devices/msp/peripherals/hw_spgss.h>
#include <ti/devices/msp/peripherals/hw_unicomm.h>
#include <ti/devices/msp/peripherals/hw_unicommi2cc.h>
#include <ti/devices/msp/peripherals/hw_unicommi2ct.h>
#include <ti/devices/msp/peripherals/hw_unicommspi.h>
#include <ti/devices/msp/peripherals/hw_unicommuart.h>
#include <ti/devices/msp/peripherals/hw_vref.h>
#include <ti/devices/msp/peripherals/hw_wuc.h>
#include <ti/devices/msp/peripherals/hw_wwdt.h>
#include <ti/devices/msp/peripherals/m0p/hw_factoryregion.h>
#include <ti/devices/msp/peripherals/m0p/hw_cpuss.h>
#include <ti/devices/msp/peripherals/m0p/hw_debugss.h>
#include <ti/devices/msp/peripherals/m0p/hw_sysctl.h>

#define __MSPM0_HAS_ADC12__
#define __MSPM0_HAS_AESADV__
#define __MSPM0_HAS_TIMER_B__
#define __MSPM0_HAS_COMP__
#define __MSPM0_HAS_CRC__
#define __MSPM0_HAS_GPIO__
#define __MSPM0_HAS_KEYSTORE_CTL__
#define __MSPM0_HAS_LFSS__
#define __MSPM0_HAS_RTC_B__
#define __MSPM0_HAS_IWDT__
#define __MCU_HAS_SPGSS__
#define __MCU_HAS_UNICOMMI2CC__
#define __MCU_HAS_UNICOMMI2CT__
#define __MCU_HAS_UNICOMMSPI__
#define __MCU_HAS_UNICOMMUART__
#define __MCU_HAS_UNICOMM__
#define __MSPM0_HAS_VREF__
#define __MSPM0_HAS_WWDT__
#define __MSPM0_HAS_ECC__

/*@}*/ /* end of group MSPM0L112X_Peripherals */

/******************************************************************************
* Device and peripheral memory map                                            *
******************************************************************************/
/** @addtogroup MSPM0L112X_MemoryMap MSPM0L112X Memory Mapping
  @{
*/

#define ADC0_BASE                      (0x40004000U)     /*!< Base address of module ADC0 */
#define COMP0_BASE                     (0x40008000U)     /*!< Base address of module COMP0 */
#define VREF_BASE                      (0x40030000U)     /*!< Base address of module VREF */
#define WWDT0_BASE                     (0x40080000U)     /*!< Base address of module WWDT0 */
#define TIMG14_BASE                    (0x40084000U)     /*!< Base address of module TIMG14 */
#define TIMG1_BASE                     (0x40086000U)     /*!< Base address of module TIMG1 */
#define TIMG2_BASE                     (0x40088000U)     /*!< Base address of module TIMG2 */
#define LFSS_BASE                      (0x40094000U)     /*!< Base address of module LFSS */
#define RTC_B_BASE                     (0x40094000U)     /*!< Base address of module RTC_B */
#define IWDT_BASE                      (0x40094000U)     /*!< Base address of module IWDT */
#define GPIOA_BASE                     (0x400A0000U)     /*!< Base address of module GPIOA */
#define GPIOB_BASE                     (0x400A2000U)     /*!< Base address of module GPIOB */
#define KEYSTORECTL_BASE               (0x400AC000U)     /*!< Base address of module KEYSTORECTL */
#define SYSCTL_BASE                    (0x400AF000U)     /*!< Base address of module SYSCTL */
#define TIMB0_BASE                     (0x400B8000U)     /*!< Base address of module TIMB0 */
#define TIMB1_BASE                     (0x400BA000U)     /*!< Base address of module TIMB1 */
#define TIMB2_BASE                     (0x400BC000U)     /*!< Base address of module TIMB2 */
#define TIMB3_BASE                     (0x400BE000U)     /*!< Base address of module TIMB3 */
#define DEBUGSS_BASE                   (0x400C7000U)     /*!< Base address of module DEBUGSS */
#define EVENTLP_BASE                   (0x400C9000U)     /*!< Base address of module EVENTLP */
#define FLASHCTL_BASE                  (0x400CD000U)     /*!< Base address of module FLASHCTL */
#define CPUSS_BASE                     (0x40400000U)     /*!< Base address of module CPUSS */
#define WUC_BASE                       (0x40424000U)     /*!< Base address of module WUC */
#define IOMUX_BASE                     (0x40428000U)     /*!< Base address of module IOMUX */
#define DMA_BASE                       (0x4042A000U)     /*!< Base address of module DMA */
#define CRC0_BASE                      (0x40440000U)     /*!< Base address of module CRC0 */
#define AESADV_BASE                    (0x40442000U)     /*!< Base address of module AESADV */
#define ADC0_SVT_BASE                  (0x4055A000U)     /*!< Base address of module ADC0_SVT */
#define TIMA0_BASE                     (0x40860000U)     /*!< Base address of module TIMA0 */
#define UC4_UART_BASE                  (0x40A00000U)     /*!< Base address of module UC4_UART */
#define UC6_I2CC_BASE                  (0x40A22000U)     /*!< Base address of module UC6_I2CC */
#define UC7_I2CT_BASE                  (0x40A44000U)     /*!< Base address of module UC7_I2CT */
#define UC4_SPI_BASE                   (0x40A60000U)     /*!< Base address of module UC4_SPI */
#define UC4_BASE                       (0x40A80000U)     /*!< Base address of module UC4 */
#define UC6_BASE                       (0x40A82000U)     /*!< Base address of module UC6 */
#define UC7_BASE                       (0x40A84000U)     /*!< Base address of module UC7 */
#define SPG0_BASE                      (0x40A9F000U)     /*!< Base address of module SPG0 */
#define UC8_UART_BASE                  (0x40B00000U)     /*!< Base address of module UC8_UART */
#define UC11_UART_BASE                 (0x40B02000U)     /*!< Base address of module UC11_UART */
#define UC8_SPI_BASE                   (0x40B60000U)     /*!< Base address of module UC8_SPI */
#define UC8_BASE                       (0x40B80000U)     /*!< Base address of module UC8 */
#define UC11_BASE                      (0x40B82000U)     /*!< Base address of module UC11 */
#define FACTORYREGION_BASE             (0x41C40000U)     /*!< Base address of module FACTORYREGION */


