TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l112x.h
/* IOMUX_PINCM14[PF] Bits */
#define IOMUX_PINCM14_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM14_PF_GPIOA_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM14_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM14_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000003)
#define IOMUX_PINCM14_PF_TIMG14_CCP2                  ((uint32_t)0X00000004)
#define IOMUX_PINCM14_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM14_PF_TIMG14_CCP3                  ((uint32_t)0X00000006)
#define IOMUX_PINCM14_PF_TIMG2_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM14_PF_TIMA0_CCP1                   ((uint32_t)0X00000008)
#define IOMUX_PINCM14_PF_SYSCTL_FCC_IN                ((uint32_t)0X0000000A)
#define IOMUX_PINCM14_PF_UC4_POCI                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM14_PF_UC4_RTS                      ((uint32_t)0X0000000B)

/* IOMUX_PINCM15[PF] Bits */
#define IOMUX_PINCM15_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM15_PF_GPIOB_DIO02                  ((uint32_t)0X00000001)
#define IOMUX_PINCM15_PF_UC7_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM15_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM15_PF_TIMG1_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM15_PF_UC11_TX                      ((uint32_t)0X00000008)
#define IOMUX_PINCM15_PF_SYSCTL_HFCLKIN               ((uint32_t)0X0000000A)
#define IOMUX_PINCM15_PF_UC4_PICO                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM15_PF_UC4_TX                       ((uint32_t)0X0000000B)

/* IOMUX_PINCM16[PF] Bits */
#define IOMUX_PINCM16_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM16_PF_GPIOB_DIO03                  ((uint32_t)0X00000001)
#define IOMUX_PINCM16_PF_UC7_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM16_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM16_PF_TIMG1_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM16_PF_UC11_RX                      ((uint32_t)0X00000008)
#define IOMUX_PINCM16_PF_TIMA0_CCP0                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM16_PF_UC4_SCLK                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM16_PF_UC4_RX                       ((uint32_t)0X0000000B)

/* IOMUX_PINCM17[PF] Bits */
#define IOMUX_PINCM17_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM17_PF_GPIOB_DIO04                  ((uint32_t)0X00000001)
#define IOMUX_PINCM17_PF_UC8_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM17_PF_UC8_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM17_PF_TIMA0_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM17_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM17_PF_TIMG14_CCP0                  ((uint32_t)0X00000006)
#define IOMUX_PINCM17_PF_TIMG1_CCP0                   ((uint32_t)0X00000007)

/* IOMUX_PINCM18[PF] Bits */
#define IOMUX_PINCM18_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM18_PF_GPIOB_DIO05                  ((uint32_t)0X00000001)
#define IOMUX_PINCM18_PF_UC8_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM18_PF_UC8_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM18_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000004)
#define IOMUX_PINCM18_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM18_PF_TIMG14_CCP1                  ((uint32_t)0X00000006)
#define IOMUX_PINCM18_PF_TIMG1_CCP1                   ((uint32_t)0X00000007)

/* IOMUX_PINCM19[PF] Bits */
#define IOMUX_PINCM19_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM19_PF_GPIOA_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM19_PF_UC8_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM19_PF_UC8_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM19_PF_UC4_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM19_PF_UC4_CTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM19_PF_UC6_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM19_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM19_PF_TIMA_FAULT2                  ((uint32_t)0X00000006)
#define IOMUX_PINCM19_PF_TIMA_FAULT0                  ((uint32_t)0X00000007)
#define IOMUX_PINCM19_PF_TIMG2_CCP1                   ((uint32_t)0X00000009)
#define IOMUX_PINCM19_PF_SYSCTL_HFCLKIN               ((uint32_t)0X0000000A)
#define IOMUX_PINCM19_PF_UC4_POCI                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM19_PF_UC4_RTS                      ((uint32_t)0X0000000B)

/* IOMUX_PINCM20[PF] Bits */
#define IOMUX_PINCM20_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM20_PF_GPIOA_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM20_PF_UC8_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM20_PF_UC8_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM20_PF_UC4_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM20_PF_UC4_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM20_PF_UC6_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM20_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM20_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM20_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM20_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000008)
#define IOMUX_PINCM20_PF_TIMG2_CCP0                   ((uint32_t)0X00000009)
#define IOMUX_PINCM20_PF_UC4_CS0                      ((uint32_t)0X0000000B)
#define IOMUX_PINCM20_PF_UC4_CTS                      ((uint32_t)0X0000000B)

/* IOMUX_PINCM21[PF] Bits */
#define IOMUX_PINCM21_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM21_PF_GPIOA_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM21_PF_UC4_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM21_PF_UC4_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM21_PF_UC4_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM21_PF_UC4_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM21_PF_UC6_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM21_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM21_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM21_PF_TIMG14_CCP0                  ((uint32_t)0X00000007)
#define IOMUX_PINCM21_PF_UC7_SDA                      ((uint32_t)0X00000008)
#define IOMUX_PINCM21_PF_TIMA_FAULT1                  ((uint32_t)0X0000000A)

/* IOMUX_PINCM22[PF] Bits */
#define IOMUX_PINCM22_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM22_PF_GPIOA_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM22_PF_UC4_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM22_PF_UC4_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM22_PF_UC6_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM22_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM22_PF_COMP0_OUT                    ((uint32_t)0X00000006)
#define IOMUX_PINCM22_PF_TIMG14_CCP1                  ((uint32_t)0X00000007)
#define IOMUX_PINCM22_PF_UC7_SCL                      ((uint32_t)0X00000008)
#define IOMUX_PINCM22_PF_TIMA_FAULT0                  ((uint32_t)0X0000000A)

/* IOMUX_PINCM23[PF] Bits */
#define IOMUX_PINCM23_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM23_PF_GPIOB_DIO06                  ((uint32_t)0X00000001)
#define IOMUX_PINCM23_PF_UC8_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM23_PF_UC8_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM23_PF_UC8_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM23_PF_TIMG14_CCP2                  ((uint32_t)0X00000005)
#define IOMUX_PINCM23_PF_TIMG1_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM23_PF_TIMA_FAULT2                  ((uint32_t)0X00000008)

/* IOMUX_PINCM24[PF] Bits */
#define IOMUX_PINCM24_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM24_PF_GPIOB_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM24_PF_UC8_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM24_PF_UC8_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM24_PF_UC8_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM24_PF_TIMG14_CCP3                  ((uint32_t)0X00000005)
#define IOMUX_PINCM24_PF_TIMG1_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM24_PF_LCD_LCDLFCLK                 ((uint32_t)0X00000008)

/* IOMUX_PINCM25[PF] Bits */
#define IOMUX_PINCM25_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM25_PF_GPIOB_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM25_PF_UC8_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM25_PF_UC8_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM25_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM25_PF_COMP0_OUT                    ((uint32_t)0X00000006)
#define IOMUX_PINCM25_PF_TIMG1_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM25_PF_LCD_LCDSON                   ((uint32_t)0X00000008)

