TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l112x.h
/* IOMUX_PINCM26[PF] Bits */
#define IOMUX_PINCM26_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM26_PF_GPIOB_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM26_PF_UC8_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM26_PF_UC8_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM26_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM26_PF_TIMA0_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM26_PF_TIMG1_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM26_PF_LCD_LCDEN                    ((uint32_t)0X00000008)

/* IOMUX_PINCM27[PF] Bits */
#define IOMUX_PINCM27_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM27_PF_GPIOB_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM27_PF_TIMG14_CCP0                  ((uint32_t)0X00000002)
#define IOMUX_PINCM27_PF_TIMG14_CCP2                  ((uint32_t)0X00000003)
#define IOMUX_PINCM27_PF_COMP0_OUT                    ((uint32_t)0X00000004)
#define IOMUX_PINCM27_PF_TIMG1_CCP0                   ((uint32_t)0X00000005)

/* IOMUX_PINCM28[PF] Bits */
#define IOMUX_PINCM28_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM28_PF_GPIOB_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM28_PF_TIMG14_CCP1                  ((uint32_t)0X00000002)
#define IOMUX_PINCM28_PF_TIMG14_CCP3                  ((uint32_t)0X00000003)
#define IOMUX_PINCM28_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000004)
#define IOMUX_PINCM28_PF_TIMG1_CCP1                   ((uint32_t)0X00000005)

/* IOMUX_PINCM29[PF] Bits */
#define IOMUX_PINCM29_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM29_PF_GPIOB_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM29_PF_TIMA0_CCP2                   ((uint32_t)0X00000003)
#define IOMUX_PINCM29_PF_TIMA_FAULT1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM29_PF_TIMA0_CCP1                   ((uint32_t)0X00000005)

/* IOMUX_PINCM30[PF] Bits */
#define IOMUX_PINCM30_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM30_PF_GPIOB_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM30_PF_TIMA0_CCP3                   ((uint32_t)0X00000003)
#define IOMUX_PINCM30_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM30_PF_UC8_CS0                      ((uint32_t)0X00000007)

/* IOMUX_PINCM31[PF] Bits */
#define IOMUX_PINCM31_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM31_PF_GPIOB_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM31_PF_UC8_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM31_PF_UC8_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM31_PF_UC8_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM31_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000004)
#define IOMUX_PINCM31_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM31_PF_TIMG14_CCP2                  ((uint32_t)0X00000006)
#define IOMUX_PINCM31_PF_TIMG14_CCP0                  ((uint32_t)0X00000007)
#define IOMUX_PINCM31_PF_COMP0_OUT                    ((uint32_t)0X0000000A)

/* IOMUX_PINCM32[PF] Bits */
#define IOMUX_PINCM32_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM32_PF_GPIOB_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM32_PF_UC11_TX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM32_PF_UC8_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM32_PF_UC8_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM32_PF_UC4_POCI                     ((uint32_t)0X00000004)
#define IOMUX_PINCM32_PF_UC4_RTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM32_PF_TIMG14_CCP2                  ((uint32_t)0X00000005)
#define IOMUX_PINCM32_PF_TIMG2_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM32_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000007)
#define IOMUX_PINCM32_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000008)
#define IOMUX_PINCM32_PF_TIMG14_CCP1                  ((uint32_t)0X00000009)
#define IOMUX_PINCM32_PF_UC8_CS0                      ((uint32_t)0X0000000A)

/* IOMUX_PINCM33[PF] Bits */
#define IOMUX_PINCM33_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM33_PF_GPIOB_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM33_PF_UC11_RX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM33_PF_UC8_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM33_PF_UC8_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM33_PF_UC4_CS0                      ((uint32_t)0X00000004)
#define IOMUX_PINCM33_PF_UC4_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM33_PF_TIMG14_CCP3                  ((uint32_t)0X00000005)
#define IOMUX_PINCM33_PF_TIMG2_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM33_PF_UC4_PICO                     ((uint32_t)0X00000007)
#define IOMUX_PINCM33_PF_UC4_TX                       ((uint32_t)0X00000007)
#define IOMUX_PINCM33_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000008)

/* IOMUX_PINCM34[PF] Bits */
#define IOMUX_PINCM34_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM34_PF_GPIOA_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM34_PF_UC4_POCI                     ((uint32_t)0X00000002)
#define IOMUX_PINCM34_PF_UC4_RTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM34_PF_UC4_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM34_PF_UC4_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM34_PF_COMP0_OUT                    ((uint32_t)0X00000004)
#define IOMUX_PINCM34_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM34_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000006)
#define IOMUX_PINCM34_PF_TIMG14_CCP0                  ((uint32_t)0X00000007)
#define IOMUX_PINCM34_PF_UC7_SCL                      ((uint32_t)0X00000008)
#define IOMUX_PINCM34_PF_TIMA0_CCP2                   ((uint32_t)0X00000009)

