TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l112x.h
/* IOMUX_PINCM45[PF] Bits */
#define IOMUX_PINCM45_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM45_PF_GPIOB_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM45_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM45_PF_UC4_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM45_PF_UC4_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM45_PF_UC4_CS0                      ((uint32_t)0X00000005)
#define IOMUX_PINCM45_PF_UC4_CTS                      ((uint32_t)0X00000005)
#define IOMUX_PINCM45_PF_TIMG2_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM45_PF_TIMG14_CCP2                  ((uint32_t)0X00000007)

/* IOMUX_PINCM46[PF] Bits */
#define IOMUX_PINCM46_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM46_PF_GPIOA_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM46_PF_UC11_TX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM46_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM46_PF_TIMG1_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM46_PF_TIMG14_CCP2                  ((uint32_t)0X0000000A)

/* IOMUX_PINCM47[PF] Bits */
#define IOMUX_PINCM47_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM47_PF_GPIOA_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM47_PF_UC11_RX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM47_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM47_PF_TIMG1_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM47_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM47_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000008)
#define IOMUX_PINCM47_PF_UC6_SCL                      ((uint32_t)0X00000009)
#define IOMUX_PINCM47_PF_TIMG14_CCP3                  ((uint32_t)0X0000000A)

/* IOMUX_PINCM48[PF] Bits */
#define IOMUX_PINCM48_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM48_PF_GPIOB_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM48_PF_UC8_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM48_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM48_PF_TIMA_FAULT1                  ((uint32_t)0X00000006)
#define IOMUX_PINCM48_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM48_PF_UC6_SDA                      ((uint32_t)0X00000009)

/* IOMUX_PINCM49[PF] Bits */
#define IOMUX_PINCM49_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM49_PF_GPIOB_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM49_PF_UC8_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM49_PF_UC6_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM49_PF_TIMG14_CCP2                  ((uint32_t)0X00000005)
#define IOMUX_PINCM49_PF_UC8_PICO                     ((uint32_t)0X00000006)
#define IOMUX_PINCM49_PF_UC8_TX                       ((uint32_t)0X00000006)

/* IOMUX_PINCM50[PF] Bits */
#define IOMUX_PINCM50_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM50_PF_GPIOB_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM50_PF_UC8_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM50_PF_UC8_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM50_PF_UC6_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM50_PF_TIMG14_CCP3                  ((uint32_t)0X00000005)
#define IOMUX_PINCM50_PF_UC8_SCLK                     ((uint32_t)0X00000006)
#define IOMUX_PINCM50_PF_UC8_RX                       ((uint32_t)0X00000006)

/* IOMUX_PINCM51[PF] Bits */
#define IOMUX_PINCM51_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM51_PF_GPIOB_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM51_PF_UC8_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM51_PF_UC8_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM51_PF_TIMA_FAULT0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM51_PF_COMP0_OUT                    ((uint32_t)0X00000005)

/* IOMUX_PINCM52[PF] Bits */
#define IOMUX_PINCM52_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM52_PF_GPIOB_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM52_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM52_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)

/* IOMUX_PINCM53[PF] Bits */
#define IOMUX_PINCM53_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM53_PF_GPIOA_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM53_PF_UC11_TX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM53_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM53_PF_TIMG14_CCP2                  ((uint32_t)0X00000006)
#define IOMUX_PINCM53_PF_TIMG2_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM53_PF_TIMG14_CCP0                  ((uint32_t)0X00000009)

/* IOMUX_PINCM54[PF] Bits */
#define IOMUX_PINCM54_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM54_PF_GPIOA_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM54_PF_UC11_RX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM54_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM54_PF_TIMG14_CCP3                  ((uint32_t)0X00000006)
#define IOMUX_PINCM54_PF_TIMG2_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM54_PF_TIMG14_CCP1                  ((uint32_t)0X00000009)

/* IOMUX_PINCM55[PF] Bits */
#define IOMUX_PINCM55_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM55_PF_GPIOA_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM55_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM55_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM55_PF_COMP0_OUT                    ((uint32_t)0X00000007)
#define IOMUX_PINCM55_PF_TIMG1_CCP0                   ((uint32_t)0X0000000A)

